; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v6 ?v2)
             (pred_12 ?v3 ?v11)
             (pred_6 ?v6 ?v11)
             (pred_4 ?v5 ?v6 )
	     (pred_1 ?v6)
             (pred_8 ?v12)
             (pred_2 ?v3)
             (pred_3 ?v11)
             (pred_10 ?v6)
             (pred_7 ?v3)
             (pred_11 ?v6)
             (pred_9 ))



(:action op_2
:parameters (?v10 ?v8 ?v7 ?v13)
:precondition (and (pred_8 ?v10) (pred_8 ?v8) (pred_2 ?v7) (pred_3 ?v13)
          (pred_5 ?v10 ?v8) (pred_12 ?v7 ?v13)
                   (pred_6 ?v8 ?v13) (pred_1 ?v10) 
                   (pred_10 ?v8) (pred_7 ?v7))
:effect (and  (pred_11 ?v8) (not (pred_10 ?v8))))


(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_8 ?v10) (pred_8 ?v1)
               (pred_1 ?v10) (pred_5 ?v10 ?v1) (pred_11 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v10))))

(:action op_1
:parameters (?v10 ?v7)
:precondition (and (pred_8 ?v10) (pred_2 ?v7) 
                  (pred_1 ?v10) (pred_4 ?v7 ?v10) (pred_9 ))
:effect (and (pred_7 ?v7)
   (not (pred_4 ?v7 ?v10)) (not (pred_9 ))))


(:action op_3
:parameters (?v10 ?v4 ?v9)
:precondition (and (pred_8 ?v10) (pred_2 ?v4) (pred_2 ?v9)
                  (pred_1 ?v10) (pred_7 ?v9) (pred_4 ?v4 ?v10))
:effect (and (pred_7 ?v4) (pred_4 ?v9 ?v10)
        (not (pred_7 ?v9)) (not (pred_4 ?v4 ?v10))))

(:action op_4
:parameters (?v10 ?v7)
:precondition (and (pred_8 ?v10) (pred_2 ?v7) 
                  (pred_1 ?v10) (pred_7 ?v7))
:effect (and (pred_9 ) (pred_4 ?v7 ?v10) (not (pred_7 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_23 obj_18 obj_12 obj_15 obj_24 obj_17 obj_14 obj_20 obj_06 obj_32 obj_02 obj_27 obj_30 obj_16 obj_31 obj_21 obj_11 obj_08 obj_01 obj_22 obj_28 obj_07 obj_26 obj_05 obj_29
    obj_25 obj_04 obj_19
    obj_03 obj_09 obj_13 obj_10
    )

    (:init
       (pred_9)

       (pred_8 obj_23)
       (pred_8 obj_18)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_24)
       (pred_8 obj_17)
       (pred_8 obj_14)
       (pred_8 obj_20)
       (pred_8 obj_06)
       (pred_8 obj_32)
       (pred_8 obj_02)
       (pred_8 obj_27)
       (pred_8 obj_30)
       (pred_8 obj_16)
       (pred_8 obj_31)
       (pred_8 obj_21)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_22)
       (pred_8 obj_28)
       (pred_8 obj_07)
       (pred_8 obj_26)
       (pred_8 obj_05)
       (pred_8 obj_29)
       (pred_3 obj_25)
       (pred_3 obj_04)
       (pred_3 obj_19)
       (pred_2 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_13)
       (pred_2 obj_10)

       (pred_5 obj_23 obj_17)
       (pred_5 obj_23 obj_18)
       (pred_5 obj_18 obj_14)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_23)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_15)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_15 obj_06)
       (pred_5 obj_15 obj_24)
       (pred_5 obj_15 obj_12)
       (pred_5 obj_24 obj_32)
       (pred_5 obj_24 obj_15)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_14)
       (pred_5 obj_17 obj_23)
       (pred_5 obj_14 obj_27)
       (pred_5 obj_14 obj_20)
       (pred_5 obj_14 obj_18)
       (pred_5 obj_14 obj_17)
       (pred_5 obj_20 obj_30)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_32)
       (pred_5 obj_06 obj_15)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_32 obj_31)
       (pred_5 obj_32 obj_24)
       (pred_5 obj_32 obj_06)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_02 obj_27)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_27 obj_11)
       (pred_5 obj_27 obj_30)
       (pred_5 obj_27 obj_14)
       (pred_5 obj_27 obj_02)
       (pred_5 obj_30 obj_08)
       (pred_5 obj_30 obj_16)
       (pred_5 obj_30 obj_20)
       (pred_5 obj_30 obj_27)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_16 obj_31)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_30)
       (pred_5 obj_31 obj_22)
       (pred_5 obj_31 obj_32)
       (pred_5 obj_31 obj_16)
       (pred_5 obj_21 obj_28)
       (pred_5 obj_21 obj_11)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_11 obj_07)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_11 obj_27)
       (pred_5 obj_11 obj_21)
       (pred_5 obj_08 obj_26)
       (pred_5 obj_08 obj_01)
       (pred_5 obj_08 obj_30)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_01 obj_22)
       (pred_5 obj_01 obj_16)
       (pred_5 obj_01 obj_08)
       (pred_5 obj_22 obj_29)
       (pred_5 obj_22 obj_31)
       (pred_5 obj_22 obj_01)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_28 obj_21)
       (pred_5 obj_07 obj_26)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_07 obj_28)
       (pred_5 obj_26 obj_05)
       (pred_5 obj_26 obj_08)
       (pred_5 obj_26 obj_07)
       (pred_5 obj_05 obj_29)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_05 obj_26)
       (pred_5 obj_29 obj_22)
       (pred_5 obj_29 obj_05)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_02)
       (pred_10 obj_32)
       (pred_6  obj_07 obj_25)
       (pred_6  obj_14 obj_04)
       (pred_6  obj_02 obj_19)
       (pred_6  obj_32 obj_19)
       (pred_11 obj_23)
       (pred_11 obj_18)
       (pred_11 obj_12)
       (pred_11 obj_15)
       (pred_11 obj_24)
       (pred_11 obj_17)
       (pred_11 obj_20)
       (pred_11 obj_06)
       (pred_11 obj_27)
       (pred_11 obj_30)
       (pred_11 obj_16)
       (pred_11 obj_31)
       (pred_11 obj_21)
       (pred_11 obj_11)
       (pred_11 obj_08)
       (pred_11 obj_01)
       (pred_11 obj_22)
       (pred_11 obj_28)
       (pred_11 obj_26)
       (pred_11 obj_05)
       (pred_11 obj_29)

       (pred_12  obj_03 obj_25)
       (pred_12  obj_09 obj_04)
       (pred_12  obj_13 obj_19)
       (pred_12  obj_10 obj_25)
       (pred_4 obj_03 obj_20)
       (pred_4 obj_09 obj_24)
       (pred_4 obj_13 obj_23)
       (pred_4 obj_10 obj_29)
       (pred_1 obj_11)
    )

    (:goal (and
       (pred_4 obj_03 obj_08)
       (pred_4 obj_13 obj_32)
    ))
(:constraints
  (always (not (pred_1 obj_30)))
)
)

; plan
1. (op_5 obj_11 obj_08)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_08)
   goals met: 0 of 2
2. (op_5 obj_08 obj_01)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_01)
   goals met: 0 of 2
3. (op_5 obj_01 obj_16)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_16)
   goals met: 0 of 2
4. (op_5 obj_16 obj_06)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_06)
   goals met: 0 of 2
5. (op_5 obj_06 obj_20)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_20)
   goals met: 0 of 2
6. (op_5 obj_20 obj_12)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_12)
   goals met: 0 of 2
7. (op_5 obj_12 obj_18)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_18)
   goals met: 0 of 2
8. (op_5 obj_18 obj_23)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_23)
   goals met: 0 of 2
9. (op_1 obj_23 obj_13)
   deleted: (pred_4 obj_13 obj_23) (pred_9)
   added: (pred_7 obj_13)
   goals met: 0 of 2
10. (op_5 obj_23 obj_18)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_18)
   goals met: 0 of 2
11. (op_5 obj_18 obj_12)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_12)
   goals met: 0 of 2
12. (op_5 obj_12 obj_20)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_20)
   goals met: 0 of 2
13. (op_5 obj_20 obj_06)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_06)
   goals met: 0 of 2
14. (op_2 obj_06 obj_32 obj_13 obj_19)
   deleted: (pred_10 obj_32)
   added: (pred_11 obj_32)
   goals met: 0 of 2
15. (op_5 obj_06 obj_32)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_32)
   goals met: 0 of 2
16. (op_4 obj_32 obj_13)
   deleted: (pred_7 obj_13)
   added: (pred_9) (pred_4 obj_13 obj_32)
   goals met: 1 of 2
17. (op_5 obj_32 obj_06)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_06)
   goals met: 1 of 2
18. (op_5 obj_06 obj_20)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_20)
   goals met: 1 of 2
19. (op_1 obj_20 obj_03)
   deleted: (pred_4 obj_03 obj_20) (pred_9)
   added: (pred_7 obj_03)
   goals met: 1 of 2
20. (op_5 obj_20 obj_06)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_06)
   goals met: 1 of 2
21. (op_5 obj_06 obj_16)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_16)
   goals met: 1 of 2
22. (op_5 obj_16 obj_01)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_01)
   goals met: 1 of 2
23. (op_5 obj_01 obj_08)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_08)
   goals met: 1 of 2
24. (op_4 obj_08 obj_03)
   deleted: (pred_7 obj_03)
   added: (pred_9) (pred_4 obj_03 obj_08)
   goals met: 2 of 2
